# 2)
# Slicing გამოიყენება სიის ნაწილის ამოსაჭრელად.
# სინტაქსი: list[start:end:step]

# 3) 
fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"]
print("მესამე ელემენტი:", fruits[2])

# 4) მეორე ელემენტის შეცვლა 25-ით
numbers = [10, 20, 30, 40, 50]
numbers[1] = 25
print("განახლებული სია:", numbers)

# 5) 
colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]
index = int(input("შეიყვანე ინდექსი (0-4): "))
print("არჩეული ფერი:", colors[index])

# 6) ბოლო ელემენტის შეცვლა
animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"]
animals[-1] = "გემი"
print("განახლებული animals:", animals)

# 7)
colors2 = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]
index = int(input("შეიყვანე ინდექსი: "))
new_color = input("შეიყვანე ახალი ფერი: ")
colors2[index] = new_color
print("განახლებული colors:", colors2)

# 8) 
numbers_step = [5, 10, 15, 20, 25, 30, 35, 40]
print("ყოველი მეორე რიცხვი:", numbers_step[::2])

# 9)
fruits2 = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"]
print("შუა 3 ხილი:", fruits2[2:5])

# 10) 
mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77]

print("ლუწი რიცხვები:")
for num in mixed_nums:
    if num % 2 == 0:
        print(num)