# 1

# Custom ფუნქციები არის პროგრამისტის მიერ შექმნილი ფუნქციები, რომლებიც კონკრეტული დავალების შესასრულებლად გამოიყენება.

# მათი დანიშნულებაა კოდის გამარტივება, მრავალჯერ გამოყენება და პროგრამის უკეთ ორგანიზება.

# ფუნქციის შექმნის ეტაპები:

# 1. ვწერთ def საკვანძო სიტყვას.

# 2. ვწერთ ფუნქციის სახელს.

# 3. ფრჩხილებში ვუთითებთ პარამეტრებს.

# 4. ვწერთ : სიმბოლოს.

# 5. ფუნქციის სხეულში ვწერთ შესასრულებელ კოდს.

# 6. საჭიროების შემთხვევაში ვიყენებთ return-ს მნიშვნელობის დასაბრუნებლად.

#

# პარამეტრი - ცვლადია, რომელიც ფუნქციის შექმნისას იწერება.

# არგუმენტი - რეალური მნიშვნელობაა, რომელიც ფუნქციის გამოძახებისას გადაეცემა.

# 2
def sum_numbers(num1, num2):
    return num1 + num2

# 3
def check_even(number):
    if number % 2 == 0:
        print("რიცხვი ლუწია")
    else:
        print("რიცხვი კენტია")

# 4
def square(number):
    return number ** 2

# 5
def to_uppercase(text):
    return text.upper()

# 6
def full_name(name, surname):
    print("მომხმარებლის სახელია", name, "და გვარია", surname)