# 2) 
# სია იქმნება კვადრატული ფრჩხილებით [].

# მაგალითი:
numbers = [1, 2, 3, 4, 5]


# 3) 
# ინდექსების ათვლა იწყება 0-დან.
# მაგალითად:
# 0 -> პირველი ელემენტი
# 1 -> მეორე ელემენტი
# 2 -> მესამე ელემენტი და ა.შ.


# 4)
names = ["Gio", "Nika", "Luka", "Saba", "Data", "Goga", "Andria"]


names[1] = "Toko"


names[5] = "Giorgi"

print(names)


# 5) 
my_list = ["Apple", 25, True, "Python", 3.14, "Car", False]

# მე-2, მე-4 და მე-6 ელემენტების გამოტანა
print(my_list[1])  # მეორე ელემენტი
print(my_list[3])  # მეოთხე ელემენტი
print(my_list[5])  # მეექვსე ელემენტი

# ისინი გამოგვაქვს ინდექსების გამოყენებით.
# რადგან ინდექსების ათვლა 0-დან იწყება:
# მეორე ელემენტი -> ინდექსი 1
# მეოთხე ელემენტი -> ინდექსი 3
# მეექვსე ელემენტი -> ინდექსი 5


# 6)
# ცვლადი (Variable) ჩვეულებრივ ინახავს ერთ მნიშვნელობას.
# მაგალითი:
age = 15

# List (სია) კი ერთ ცვლადში ინახავს რამდენიმე მნიშვნელობას.
# მაგალითი:
ages = [15, 16, 17, 18]

# ანუ:
# Variable -> ერთი მნიშვნელობა
# List -> რამდენიმე მნიშვნელობა