# 2) ლოგიკური და შედარების ოპერატორების 10 მაგალითი

# True მაგალითები
print(5 > 3)          # True
print(10 == 10)       # True
print(7 != 2)         # True
print(8 >= 8)         # True
print(True and True)  # True

# False მაგალითები
print(4 < 2)          # False
print(9 == 5)         # False
print(6 != 6)         # False
print(3 > 8)          # False
print(True and False) # False


# 3)

# Sequencing - როდესაც კოდი სრულდება ზუსტად იმ თანმიმდევრობით
# როგორც დაწერილია

# Iteration - როდესაც ერთი და იგივე მოქმედება რამდენჯერმე მეორდება
# ციკლის (loop) გამოყენებით

# Selection - როდესაც პროგრამა იღებს გადაწყვეტილებას
# გარკვეული პირობის მიხედვით (if elif, else)


# 4) 

# For loop არის ციკლი რომელიც გვეხმარება ერთი და იგივე
# მოქმედების რამდენჯერმე შესრულებაში


# 5) 

# range() ფუნქციას გადაეცემა რიცხვები რომლებიც განსაზღვრავენ
# რამდენჯერ უნდა შესრულდეს ციკლი.
# მაგალითად range(5) შექმნის რიცხვებს 0 1 2 3 4
# for loop ამ რიცხვებს სათითაოდ იღებს და ასრულებს კოდს.


# 7)

for i in range(10):
    print("BMW")


# 8)

for i in range(100):
    print("აქ ჩაწერე შენი გვარი")


# 9)

for i in range(46):
    print("შავი")


# 10)

for i in range(32):
    print("T")