
# 1) ფუნქცია არის კოდის ბლოკი, რომელიც ასრულებს კონკრეტულ დავალებას.
# ფუნქციის გამოძახებისას სრულდება მასში დაწერილი კოდი.


# 2) print() არის ჩაშენებული (built-in) ფუნქცია.
# მისი გამოყენებით ეკრანზე გამოაქვს ტექსტი, რიცხვები და სხვა მონაცემები.


# 3) არგუმენტები არის მნიშვნელობები, რომლებსაც ფუნქციას გადავცემთ.
# მაგალითად print("Hello") ფუნქციის არგუმენტია "Hello".


# 4) .upper() - ტექსტის ყველა ასოს დიდ ასოდ აქცევს.
# .lower() - ტექსტის ყველა ასოს პატარა ასოდ აქცევს.
# .capitalize() - პირველი ასო დიდი ხდება, დანარჩენი კი პატარა.


# 5)


print("hello".upper())
print("python".upper())

print("HELLO".lower())
print("PYTHON".lower())


print("hello".capitalize())
print("pYTHON".capitalize())


print("hello".find("e"))
print("python".find("t"))
