
# 1

# .upper() - ტექსტის ყველა ასოს დიდ ასოდ გარდაქმნის.
# .lower() - ტექსტის ყველა ასოს პატარა ასოდ გარდაქმნის.
# .capitalize() - პირველი ასო ხდება დიდი, დანარჩენი კი პატარა.
# .find() - ეძებს სიმბოლოს ან სიტყვას და აბრუნებს მის ინდექსს.
# .count() - ითვლის რამდენჯერ გვხვდება სიმბოლო ან სიტყვა.
# len() - ითვლის ტექსტში სიმბოლოების რაოდენობას.
# .endswith() - ამოწმებს, მთავრდება თუ არა ტექსტი მითითებული სიმბოლოთი ან სიტყვით.
# .startswith() - ამოწმებს, იწყება თუ არა ტექსტი მითითებული სიმბოლოთი ან სიტყვით.


# 2

sentence = input("შეიყვანე წინადადება: ")
print(sentence.lower())


# 3

email = input("შეიყვანე ელფოსტა: ")
result = str("@" in email)
print(result.upper())


# 4

book = input("შეიყვანე წიგნის დასახელება: ")
print(book.capitalize())

# 5

sentence = input("შეიყვანე წინადადება: ")
symbol = input("შეიყვანე სიმბოლო: ")
print(sentence.count(symbol))


# 6

word = input("შეიყვანე სიტყვა: ")

if word == word.upper():
    print("სიტყვა უკვე დიდია!")
else:
    print(word.upper())
